In [1]:
"""
in dictionaries we use {} calibrackets
"""

'\nin dictionaries we use {} calibrackets\n'

In [7]:
my_dic ={
    "name":"Salome",
    "age":24
}

print(my_dic["name"])

Salome

In [11]:
my_dic ={"name":"Salome","age":24}

print(my_dic["name"])

Salome

In [25]:
my_dictionary={"name":"person 1","age":35,"salary":600}

In [87]:
my_dictionary ={"name":["person 1","person 2","person 3","person 4","person 5"],"age":[35,100,34,456,67],"salary":[600,400,450,332,75000]}

In [45]:
my_dictionary["location"] =[ "Kakamega","Mombasa","Kisumu","Moyale","Marsabit"] #adding of location to our list.

In [47]:
my_dictionary

{'name': 'person 1',
 'age': 35,
 'salary': 600,
 'location': ['Kakamega', 'Mombasa', 'Kisumu', 'Moyale', 'Marsabit']}

In [51]:
print(my_dictionary) #gives the

{'name': 'person 1', 'age': 35, 'salary': 600, 'location': ['Kakamega', 'Mombasa', 'Kisumu', 'Moyale', 'Marsabit']}

In [63]:
my_dictionary ={"name":["person 1","person 2","person 3","person 4","person 5"],"age":[35,100,34,456,67],"salary":[600,400,450,332,75000]}

In [57]:
for key, value in my_dictionary. items(): #using for loop 
    print(key,value)

name person 1
age 35
salary 600
location ['Kakamega', 'Mombasa', 'Kisumu', 'Moyale', 'Marsabit']

In [65]:
my_dictionary ={"name":["person 1","person 2","person 3","person 4","person 5"],"age":[35,100,34,456,67],"salary":[600,400,450,332,75000]}

In [67]:
my_dictionary #missing of commas/addition is vital as it can make you become stuck

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [600, 400, 450, 332, 75000]}

In [69]:
print(my_dictionary)

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'], 'age': [35, 100, 34, 456, 67], 'salary': [600, 400, 450, 332, 75000]}

In [71]:
for key, value in my_dictionary. items():
    print(key,value)

name ['person 1', 'person 2', 'person 3', 'person 4', 'person 5']
age [35, 100, 34, 456, 67]
salary [600, 400, 450, 332, 75000]

In [73]:
"""
to delete a word from the dictionary, use del
"""
del my_dictionary["age"]

In [75]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'salary': [600, 400, 450, 332, 75000]}

In [77]:
del my_dictionary["salary"] #we want to remove the salary that these people are receiving

In [79]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5']}

In [91]:
my_dic ={"name":"Salome","age":24}

print(my_dic["age"])

24

In [107]:
my_dic ={"name":"Salome","age":24,"location":"Tieng're"}

print(my_dic["location"])

Tieng're

In [113]:
my_dictionary("location") =["Yala"]

SyntaxError: cannot assign to function call here. Maybe you meant '==' instead of '='? (1024556734.py, line 1)

In [115]:
"""
DataFrames-data structure that organizes data into 2D/2-dimensional table of rows and columns like a spreadsheet
To acccess the data in a specific column, use the column name in square brackets i.e print(df["name"])
designed for data manipulation and analysis

"""

'\nDataFrames\n\n'

In [117]:
import pandas as pd #importing library called Pandas, storing it in the variable called pd

In [123]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [600, 400, 450, 332, 75000]}

In [125]:
df=pd.DataFrame(my_dictionary)

In [127]:
df #df is the variable that gives the command to store the values

       name  age  salary
0  person 1   35     600
1  person 2  100     400
2  person 3   34     450
3  person 4  456     332
4  person 5   67   75000

In [129]:
print(df["name"]) #accessing data in a DataFrame, using name rep byb[]

0    person 1
1    person 2
2    person 3
3    person 4
4    person 5
Name: name, dtype: object

In [131]:
print(df["salary"]) #accessing data

0      600
1      400
2      450
3      332
4    75000
Name: salary, dtype: int64

In [135]:
print(df[["salary","name"]]) #to access more than two columns or two we use two square brackets

   salary      name
0     600  person 1
1     400  person 2
2     450  person 3
3     332  person 4
4   75000  person 5

In [166]:
my_dictionary ={"name":["person 1","person 2","person 3","person 4","person 5"],"age":[35,100,34,456,67],"salary":[600,400,450,332,75000]}

In [170]:
import pandas as pd

In [172]:
df=pd.DataFrame(my_dictionary)

In [174]:
df

       name  age  salary
0  person 1   35     600
1  person 2  100     400
2  person 3   34     450
3  person 4  456     332
4  person 5   67   75000

In [178]:
df["age"] +1  #missing a vital step, incorrect answers

0     36
1    101
2     35
3    457
4     68
Name: age, dtype: int64

In [176]:
df["age"] +1

0     36
1    101
2     35
3    457
4     68
Name: age, dtype: int64

In [180]:
df["age"] = df["age"] +1

In [196]:
df ["age"]

0     36
1    101
2     35
3    457
4     68
Name: age, dtype: int64

In [198]:
df ["age"] = df["age"] +1

In [202]:
df ["age"]

0     37
1    102
2     36
3    458
4     69
Name: age, dtype: int64

In [186]:
import pandas as pd

In [206]:
df["salary"] = df["salary"] +1

In [208]:
df ["salary"]

0      601
1      401
2      451
3      333
4    75001
Name: salary, dtype: int64

In [214]:
df.dtypes

name      object
age        int64
salary     int64
dtype: object

In [250]:
df["age"], df["salary"] = df["age"]+1, df["salary"]+500  #to get for both column for age and salary

In [252]:
df

       name  age  salary
0  person 1   38    1101
1  person 2  103     901
2  person 3   37     951
3  person 4  459     833
4  person 5   70   75501